DataProcessors/ФормированиеПлатежныхДокументовПоВзносамВФонды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеПлатежныхДокументовПоВзносамВФонды</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеКоммунальногоНалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Платежки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Платежка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяНалоговойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеКоммунальногоНалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Платежка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПараметрыРасчетаЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРасчетаЗарплатыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентВечерних</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНочных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Comment>До этой даты документ НачислениеЗарплаты проводится</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПремии</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьГодоваяПремия</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии за год</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентРасчетаОтОбратного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаВзносов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВзносовВФонды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСовместителейДляСредних</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьЛьготуНДФЛБазовуюИДетскуюПоПорогуДетской</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьЛьготуНДФЛДляБудущихПериодов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРезерваОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриУплатеЕСВОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДо</Name>
					<Comment>Если 1, то отбрасывать копейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьКоэффициентЕСВДляАвансов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ФормированиеПлатежныхДокументовПоВзносамВФонды/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит автозаполнение табличной части РКО
//
Процедура Автозаполнение() Экспорт
	
	Если ДокументыНачисления.Количество()= 0 Тогда
		#Если Клиент Тогда
		Предупреждение("Необходимо выбрать ведомости, по которойым будут формироваться платежки!");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	АвтозаполнениеВедомость();
	
КонецПроцедуры	
	
// Производит автозаполнение табличной части РКО
//
Процедура АвтозаполнениеВедомость() Экспорт
		
	
	Запрос = Новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("парамВедомости", ДокументыНачисления.ВыгрузитьКолонку("Ведомость"));
	
	//	ВТНалоги
	Если Истина Тогда
		//	Описание:
		//      осноная часть запроса, тут получим даные для проведения
		// 
		ТекстЗапросаВТ = "
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		Основной.Налог						КАК Налог,
		|		Основной.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
		|		СУММА( Основной.Результат )			КАК Результат
		|ПОМЕСТИТЬ ВТНалоги	
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.Взносы КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Результат <> 0
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка,
		|		Основной.Налог,
		|		Основной.СтатьяНалоговойдекларации
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		Основной.Налог						КАК Налог,
		|		Основной.СтатьяНалоговойдекларации	КАК СтатьяНалоговойдекларации,
		|		СУММА( Основной.Результат )		КАК Результат
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.ВзносыФОТ КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Результат <> 0
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка,
		|		Основной.Налог,
		|		Основной.СтатьяНалоговойдекларации
		|
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		""""								КАК Налог,
		|		""""								КАК СтатьяНалоговойдекларации,
		|		СУММА( Основной.Налог )			КАК Результат
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Налог <> 0
		|       И Основной.ДоходНДФЛ.ВидСтавкиВоенныйСбор <> Основной.ДоходНДФЛ.ВидСтавкиРезидента
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка
		|
		//ВОЕННЫй СБОР
		|   ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|		Основной.Ссылка						КАК Ссылка,
		|		Основной.Ссылка.Организация			КАК Организация,
		|		""""								КАК Налог,
		|		ЗНАЧЕНИЕ(Справочник.Налоги.ВоенныйСбор)	КАК СтатьяНалоговойдекларации,
		|		СУММА( Основной.Налог )			КАК Результат
		|   ИЗ	Документ.ЗарплатаКВыплатеОрганизаций.НДФЛ КАК Основной
		|	ГДЕ Основной.Ссылка в (&парамВедомости)
		|       И Основной.Налог <> 0
		|       И Основной.ДоходНДФЛ.ВидСтавкиВоенныйСбор = Основной.ДоходНДФЛ.ВидСтавкиРезидента
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Ссылка
		|";
		Запрос.Текст = ТекстЗапросаВТ;
		Запрос.УстановитьПараметр("КоммунальныйНалог",Справочники.Налоги.КоммунальныйНалог);
		Запрос.Выполнить();
		ТекстЗапросаВТНалоги = "ВТНалоги";
	КонецЕсли;
	
	ТекстЗапроса = "	       
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетУчета	
	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
	|	КОНЕЦ	                                КАК СчетУчета,
	|	Начисления.Ссылка						КАК Ведомость,
	|	Начисления.Налог						КАК Налог,
	|	Начисления.СтатьяНалоговойДекларации	КАК СтатьяНалоговойДекларации,
	|	Начисления.Результат					КАК Сумма,
	|	ЕСТЬNULL(ПлатежноеПоручение.Ссылка, ЗНАЧЕНИЕ(Документ.ПлатежноеПоручениеИсходящее.ПустаяСсылка)) КАК Платежка,
	|	НЕ ЕСТЬNULL(ПлатежноеПоручение.Ссылка.Проведен, ЛОЖЬ) КАК Отметка,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.Контрагент	
	|			ИНАЧЕ ПараметрыСтрогие.Контрагент	
	|	КОНЕЦ	                                КАК Контрагент,
	|	ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
	|			ТОГДА Параметры.СчетКонтрагента	
	|			ИНАЧЕ ПараметрыСтрогие.СчетКонтрагента	
	|	КОНЕЦ	                                КАК СчетКонтрагента
	|ИЗ ВТНалоги КАК Начисления
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ  (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК ПараметрыСтрогие
	|	ПО Начисления.Организация = ПараметрыСтрогие.Организация
	|	И (Начисления.СтатьяНалоговойДекларации = ПараметрыСтрогие.СтатьяНалоговойДекларации
	|	ИЛИ  Начисления.СтатьяНалоговойДекларации = """" И ПараметрыСтрогие.СтатьяНалоговойДекларации = Неопределено)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (" + ПроведениеРасчетов.ПолучитьПараметрыПлатежекПоВзносамВФонды(Организация) + ") КАК Параметры
	|ПО		Начисления.Организация = Параметры.Организация
	|    И	(Параметры.СтатьяНалоговойдекларации = ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхдеклараций.ПустаяСсылка) И Начисления.Налог = """"
	|    ИЛИ	Начисления.СтатьяНалоговойдекларации.Родитель = Параметры.СтатьяНалоговойдекларации)
	|
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.ПеречислениеНалогов КАК ПлатежноеПоручение
 	|ПО		Начисления.Ссылка = ПлатежноеПоручение.Ведомость
 	|	И ВЫБОР	КОГДА ПараметрыСтрогие.СчетУчета ЕСТЬ NULL
 	|			ТОГДА Параметры.СчетУчета	
 	|			ИНАЧЕ ПараметрыСтрогие.СчетУчета	
 	|	КОНЕЦ	                                = ПлатежноеПоручение.Ссылка.СчетУчетаРасчетовСКонтрагентом
 	|	И	((ПлатежноеПоручение.СубконтоДт1 = ЗНАЧЕНИЕ(Справочник.налоги.ПустаяСсылка) И Начисления.Налог = """")
 	|	ИЛИ	(Начисления.Налог = ПлатежноеПоручение.СубконтоДт1
 	|	И	Начисления.СтатьяНалоговойДекларации = ПлатежноеПоручение.СубконтоДт2)
	//ВОЕННЫй СБОР
	|	ИЛИ	(Начисления.СтатьяНалоговойДекларации = ПлатежноеПоручение.СубконтоДт1
 	|	И	Начисления.Налог = """"))
 	|
	|
	|ИТОГИ СУММА(Сумма) ПО
	|	СчетУчета, Контрагент, СчетКонтрагента
	|
	|";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);

	ОкруглятьВБольшую = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", Организация)).ПриУплатеЕСВОкруглятьВБольшуюСторону;

	ВыборкаПоСчетуУчета =  Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСчетуУчета.Следующий() Цикл
		ВыборкаПоКонтрагент =  ВыборкаПоСчетуУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКонтрагент.Следующий() Цикл
			ВыборкаПоСчетКонтрагента = ВыборкаПоКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСчетКонтрагента.Следующий() Цикл
				
				СтрПлатежки = Платежки.Добавить();
				СтрПлатежки.СчетУчета 		= ВыборкаПоСчетКонтрагента.СчетУчета;
				СтрПлатежки.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
				СтрПлатежки.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
				ИтогСум = 0;
				
				ВыборкаПоНалогам =  ВыборкаПоСчетКонтрагента.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока ВыборкаПоНалогам.Следующий() Цикл
					СтрПлатежки.Платежка		= ВыборкаПоНалогам.Платежка;
					СтрПлатежки.Отметка			= ВыборкаПоНалогам.Отметка;
					
					СтрНалоги = Налоги.Добавить();
					СтрНалоги.СчетУчета 				= ВыборкаПоНалогам.СчетУчета;
					Сум     		= ВыборкаПоНалогам.Сумма;
					Если ОкруглятьВБольшую Тогда
						Сум = Окр(Сум,2) + ?(Сум-Окр(Сум,2)>0, 0.01, 0);
					Иначе
						Сум = Окр(Сум,2);
					КонецЕсли;	
					ИтогСум = ИтогСум + Сум;
					СтрНалоги.Сумма     				= Сум;
					Если ВыборкаПоНалогам.СтатьяНалоговойДекларации <> Справочники.Налоги.ВоенныйСбор Тогда
						СтрНалоги.Налог						= ВыборкаПоНалогам.Налог;
						СтрНалоги.СтатьяНалоговойДекларации	= ВыборкаПоНалогам.СтатьяНалоговойДекларации;
					Иначе
						СтрНалоги.Налог						= Справочники.Налоги.ВоенныйСбор;
						СтрНалоги.СтатьяНалоговойДекларации	= "";
					КонецЕсли;	
					СтрНалоги.Ведомость					= ВыборкаПоНалогам.Ведомость;
					СтрНалоги.Контрагент		= ВыборкаПоСчетКонтрагента.Контрагент;
					СтрНалоги.СчетКонтрагента = ВыборкаПоСчетКонтрагента.СчетКонтрагента;
					
					СтрНалоги.Платежка					= ВыборкаПоНалогам.Платежка;
				КонецЦикла;
				СтрПлатежки.Сумма  = ИтогСум;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Формирует номер платежного поручения в пределах расчетного счета
//
Функция УстановитьНомерПоручения(ППИ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(ППИ.Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(ППИ.Дата));
	Запрос.УстановитьПараметр("Организация", ППИ.Организация);
	Запрос.УстановитьПараметр("СчетОрганизации", ППИ.СчетОрганизации);
	

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерПоручения КАК НомерПоручения
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручение
	|
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.СчетОрганизации = &СчетОрганизации
	|	И ПлатежноеПоручение.Дата >= &ДатаНачалаГода
	|	И ПлатежноеПоручение.Дата <= &ДатаКонцаГода";

	СписокПлатежек = Запрос.Выполнить().Выбрать();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	 
	ТаблицаЗначений.Колонки.Добавить("Номер"); 
	ТаблицаЗначений.Колонки.Добавить("Длина"); 

	Пока СписокПлатежек.Следующий() Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить(); 
		НоваяСтрока.Номер = СписокПлатежек.НомерПоручения; 
		НоваяСтрока.Длина = СтрДлина(СписокПлатежек.НомерПоручения); 
	КонецЦикла;
	
	ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
	
	Попытка
		НомерПорученияЧисло = Число(ТаблицаЗначений[0].Номер) + 1;
		НомерПоручения = Формат(НомерПорученияЧисло, "ЧГ=0");
	Исключение
		НомерПоручения = 1;
	КонецПопытки;
	
	Возврат НомерПоручения;
	
КонецФункции
